openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
    /* Enable ADC. */
    Adc_ConfigureEQADC (ConfigPtr);

    /* Perform calibration of the ADC. */
    Adc_EQADCCalibrationSequence ();

    /* Configure DMA channels. */
    for (group = ADC_GROUP0; group < ConfigPtr->nbrOfGroups; group++)
    {
      /* ADC307. */
      ConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;

      Dma_ConfigureChannel ((struct tcd_t *)ConfigPtr->groupConfigPtr [group].groupDMAResults, ConfigPtr->groupConfigPtr [group].dmaResultChannel);
      Dma_ConfigureChannel ((struct tcd_t *)ConfigPtr->groupConfigPtr [group].groupDMACommands, ConfigPtr->groupConfigPtr [group].dmaCommandChannel);
    }

    /* Start DMA channels. */
    for (group = ADC_GROUP0; group < ConfigPtr->nbrOfGroups; group++)
    {
      /* Invalidate queues. */
      EQADC.CFCR[group].B.CFINV = 1;

      Dma_StartChannel (ConfigPtr->groupConfigPtr [group].dmaResultChannel);
      Dma_StartChannel (ConfigPtr->groupConfigPtr [group].dmaCommandChannel);
    }

    Adc_ConfigureEQADCInterrupts ();

    /* Move on to INIT state. */
    adcState = ADC_INIT;
    returnValue = E_OK;
  }
  else
  {
    returnValue = E_NOT_OK;
  }

  return (returnValue);  
#endif  
}

Std_ReturnType Adc_SetupResultBuffer (Adc_GroupType group, Adc_ValueGroupType *bufferPtr)
{
  Std_ReturnType returnValue = E_NOT_OK;

  /* Check for development errors. */
  if (E_OK == Adc_CheckSetupResultBuffer (group))
  {
    AdcConfigPtr->groupConfigPtr[group].status->resultBufferPtr = bufferPtr;
    
    returnValue = E_OK;
  }

  return (returnValue);
}

Adc_StreamNumSampleType Adc_GetStreamLastPointer(Adc_GroupType group, Adc_ValueGroupType** PtrToSamplePtr)
{
	Adc_StreamNumSampleType nofSample = 0;

	/** @req ADC216 */
	/* Check for development errors. */
	if ( (E_OK == Adc_CheckGetStreamLastPointer (group)) &&
		 (AdcConfigPtr->groupConfigPtr[group].status->groupStatus != ADC_BUSY) )
	{
	    if ((ADC_CONV_MODE_CONTINOUS == AdcConfigPtr->groupConfigPtr[group].conversionMode) &&
	         ((ADC_STREAM_COMPLETED    == AdcConfigPtr->groupConfigPtr[group].status->groupStatus) ||
	          (ADC_COMPLETED           == AdcConfigPtr->groupConfigPtr[group].status->groupStatus)))
	    {
	      /** @req ADC326 */
	      /** @req ADC328 */
	      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_BUSY;
	    }
	    else if ((ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[group].conversionMode) &&
	             (ADC_STREAM_COMPLETED  == AdcConfigPtr->groupConfigPtr[group].status->groupStatus))
	    {
	      /** @req ADC327. */
	      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
	    }
	    else{/* Keep status. */}

	      /* Copy the result to application buffer. */
#if defined(CFG_MPC5606S)
		if(ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[group].conversionMode)
		{
		  *PtrToSamplePtr = currResultBufPtr[group];
		}
		else
		{
		  if(ADC_ACCESS_MODE_SINGLE == AdcConfigPtr->groupConfigPtr[group].accessMode )
		  {
			*PtrToSamplePtr = currResultBufPtr[group];
		  }
		  else
		  {
			Adc_ValueGroupType *lastSamplePointer = currResultBufPtr[currGroupId];
			lastSamplePointer += (AdcConfigPtr->groupConfigPtr[group].numberOfChannels) * (currSampleCount[group] % AdcConfigPtr->groupConfigPtr[group].streamNumSamples);
			*PtrToSamplePtr = lastSamplePointer;
		  }
		}
#else
		*PtrToSamplePtr = AdcConfigPtr->groupConfigPtr[group].resultBuffer;
#endif
	}
	else
	{
		*PtrToSamplePtr = NULL;
	}

	return nofSample;
}

#if (ADC_READ_GROUP_API == STD_ON)
Std_ReturnType Adc_ReadGroup (Adc_GroupType group, Adc_ValueGroupType *dataBufferPtr)
{
  Std_ReturnType returnValue = E_OK;
  uint8_t channel;

  if (E_OK == Adc_CheckReadGroup (group))
  {
      /* Copy the result to application buffer. */
#if defined(CFG_MPC5606S)
      for (channel = 0; channel < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; channel++)
	  {
		if(ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[group].conversionMode)
		{
		  dataBufferPtr[channel] = currResultBufPtr[group][channel];
		}
		else
		{
		  if(ADC_ACCESS_MODE_SINGLE == AdcConfigPtr->groupConfigPtr[group].accessMode )
		  {
			dataBufferPtr[channel] = currResultBufPtr[group][channel];
		  }
		  else
		  {
			Adc_ValueGroupType *lastSamplePointer = currResultBufPtr[group];
			lastSamplePointer += (AdcConfigPtr->groupConfigPtr[group].numberOfChannels) * (currSampleCount[group] % AdcConfigPtr->groupConfigPtr[group].streamNumSamples);
			dataBufferPtr[channel] = lastSamplePointer[channel];
		  }
		}
	  }
#else
    for (channel = 0; channel < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; channel++)
    {
       dataBufferPtr[channel] = AdcConfigPtr->groupConfigPtr[group].resultBuffer[channel];
    }
#endif

    if ((ADC_CONV_MODE_CONTINOUS == AdcConfigPtr->groupConfigPtr[group].conversionMode) &&
         ((ADC_STREAM_COMPLETED    == AdcConfigPtr->groupConfigPtr[group].status->groupStatus) ||
          (ADC_COMPLETED           == AdcConfigPtr->groupConfigPtr[group].status->groupStatus)))
    {
      /* Not really sure about this behaviour but how can we else protect data buffer */
      if ((ADC_CONV_MODE_CONTINOUS == AdcConfigPtr->groupConfigPtr[group].conversionMode) &&
          (ADC_STREAM_COMPLETED    == AdcConfigPtr->groupConfigPtr[group].status->groupStatus))
      {
		  /* Start continous conversion again */
		  ADC_0.IMR.B.MSKECH = 1;
		  ADC_0.MCR.B.NSTART=1;
      }
      /** @req ADC329 */
      /** @req ADC331 */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_BUSY;

    }
    else if ((ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[group].conversionMode) &&
             (ADC_STREAM_COMPLETED  == AdcConfigPtr->groupConfigPtr[group].status->groupStatus))
    {
      /** @req ADC330. */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
    }
  }
  else
  {
    /* An error have been raised from Adc_CheckReadGroup(). */
    returnValue = E_NOT_OK;
  }

  return (returnValue);
}
#endif

Adc_StatusType Adc_GetGroupStatus (Adc_GroupType group)
{
  Adc_StatusType returnValue;
  if ((ADC_INIT == adcState) && (AdcConfigPtr != NULL))
  {
    /* Adc initilised, OK to move on... */
    returnValue = AdcConfigPtr->groupConfigPtr[group].status->groupStatus;
  }
  else
  {
    returnValue = ADC_IDLE;
#if ( ADC_DEV_ERROR_DETECT == STD_ON )
    Det_ReportError(MODULE_ID_ADC,0,ADC_GETGROUPSTATUS_ID, ADC_E_UNINIT );
#endif
    }

  return (returnValue);
}

