openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
#if defined(CFG_MPC5606S)
void Adc_Group0ConversionComplete (void)
{
	/* Clear ECH Flag and disable interruput */
	ADC_0.ISR.B.ECH = 1;
	ADC_0.IMR.B.MSKECH = 0;

	Adc_GroupDefType adcGroup = AdcConfigPtr->groupConfigPtr[currGroupId];
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
	/* Copy to result buffer */
	for(uint8 index=0; index < adcGroup.numberOfChannels; index++)
	{
		currResultBufPtr[currGroupId][index] = ADC_0.CDR[32+adcGroup.channelList[index]].B.CDATA;
	}
#endif
 
    if(ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[currGroupId].conversionMode)
    {
    	adcGroup.status->groupStatus = ADC_STREAM_COMPLETED;
    	  /* Call notification if enabled. */
    	#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
		if (adcGroup.status->notifictionEnable && adcGroup.groupCallback != NULL)
		{
		  adcGroup.groupCallback();
		}
    	#endif
    }
    else
    {
      if(ADC_ACCESS_MODE_SINGLE == adcGroup.accessMode )
      {
    	  adcGroup.status->groupStatus = ADC_STREAM_COMPLETED;
    	  /* Call notification if enabled. */
    	#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    	  if (adcGroup.status->notifictionEnable && adcGroup.groupCallback != NULL)
    	  {
    		  adcGroup.groupCallback();
    	  }
    	#endif
        /* Disable trigger normal conversions for ADC0 */
        ADC_0.MCR.B.NSTART = 0;
      }
      else
      {
        if(ADC_STREAM_BUFFER_LINEAR == adcGroup.streamBufferMode)
        {
            currSampleCount[currGroupId]++;
            if(currSampleCount[currGroupId] < adcGroup.streamNumSamples)
            {
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
            	currResultBufPtr[currGroupId] += adcGroup.numberOfChannels;
#endif
              adcGroup.status->groupStatus = ADC_COMPLETED;
              
              ADC_0.IMR.B.MSKECH = 1;
            }
            else
            {
              /* All sample completed. */
              adcGroup.status->groupStatus = ADC_STREAM_COMPLETED;

              /* Call notification if enabled. */
            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
              if (adcGroup.status->notifictionEnable && adcGroup.groupCallback != NULL){
            	adcGroup.groupCallback();
              }
            #endif
              /* Abort conversion */
              ADC_0.MCR.B.ABORTCHAIN = 1;

              /* Disable trigger normal conversions for ADC0 */
              ADC_0.MCR.B.NSTART=0;
            }
        }
        else if(ADC_STREAM_BUFFER_CIRCULAR == adcGroup.streamBufferMode)
        {
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
        	static Adc_ValueGroupType *oldResultBufferPtr = 0;
            
            if( currSampleCount[currGroupId] == 0) {
            	oldResultBufferPtr = currResultBufPtr[currGroupId];
            }
#endif
            currSampleCount[currGroupId]++;
            if(currSampleCount[currGroupId] < adcGroup.streamNumSamples)
            {
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
            	currResultBufPtr[currGroupId] += adcGroup.numberOfChannels;
#endif
                if( adcGroup.status->groupStatus != ADC_STREAM_COMPLETED){
                	adcGroup.status->groupStatus = ADC_COMPLETED;
                }
                
                ADC_0.IMR.B.MSKECH = 1;
            }
            else
            {
              /* Sample completed. */
              adcGroup.status->groupStatus = ADC_STREAM_COMPLETED;
              /* Call notification if enabled. */
            #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
              if (adcGroup.status->notifictionEnable && adcGroup.groupCallback != NULL)
              {
            	  adcGroup.groupCallback();
              }
            #endif
              currSampleCount[currGroupId] = 0;

#ifndef DONT_USE_DMA_IN_ADC_MPC5606S
              Dma_ConfigureDestinationAddress((uint32_t)currResultBufPtr[currGroupId], DMA_ADC_GROUP0_RESULT_CHANNEL);
#else
              currResultBufPtr[currGroupId] = oldResultBufferPtr;
#endif
              /* Disable trigger normal conversions for ADC0 */
              ADC_0.MCR.B.NSTART=0;
            }
        }
        else
        {
            //nothing to do.
        }
      }
    }
}

void Adc_WatchdogError (void)
{

}

void Adc_ADCError (void)
{

}

#else
void Adc_Group0ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_0].B.EOQF = 1;

  /* Sample completed. */
  AdcConfigPtr->groupConfigPtr[ADC_GROUP0].status->groupStatus = ADC_STREAM_COMPLETED;

  /* Call notification if enabled. */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
  if (AdcConfigPtr->groupConfigPtr[ADC_GROUP0].status->notifictionEnable && AdcConfigPtr->groupConfigPtr[ADC_GROUP0].groupCallback != NULL)
  {
    AdcConfigPtr->groupConfigPtr[ADC_GROUP0].groupCallback();
  }
#endif
}
void Adc_Group1ConversionComplete (void)
{
  /* ISR for FIFO 0 end of queue. Clear interrupt flag.  */
  EQADC.FISR[ADC_EQADC_QUEUE_1].B.EOQF = 1;

  /* Sample completed. */
  AdcConfigPtr->groupConfigPtr[ADC_GROUP1].status->groupStatus = ADC_STREAM_COMPLETED;

  /* Call notification if enabled. */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
  if (AdcConfigPtr->groupConfigPtr[ADC_GROUP1].status->notifictionEnable && AdcConfigPtr->groupConfigPtr[ADC_GROUP1].groupCallback != NULL)
  {
    AdcConfigPtr->groupConfigPtr[ADC_GROUP1].groupCallback();
  }
#endif
}

void Adc_EQADCError (void)
{
  /* Something is wrong!! Check the cause of the error and try to correct it. */
  if (EQADC.FISR[ADC_EQADC_QUEUE_0].B.TORF)
  {
    /* Trigger overrun on queue 0!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_1].B.TORF)
  {
    /* Trigger overrun on queue 1!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_0].B.CFUF)
  {
    /* Command underflow on queue 0!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_1].B.CFUF)
  {
    /* Command underflow on queue 1!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_0].B.RFOF)
  {
    /* Result overflow on queue 0!! */
    assert (0);
  }
  else if (EQADC.FISR[ADC_EQADC_QUEUE_1].B.RFOF)
  {
    /* Result overflow on queue 1!! */
    assert (0);
  }
  else
  {
    /* Something else... TODO What have we missed above */
    assert(0);
  }
}

/* Helper macro to make sure that the qommand queue have
 * executed the commands in the fifo.
 * First check that the H/W negate the
 * single scan bit and then wait for EOQ. */
#define WAIT_FOR_QUEUE_TO_FINISH(q) \
  while (EQADC.FISR[q].B.SSS)             \
  {                                       \
    ;                                     \
  }                                       \
                                          \
  while (!EQADC.FISR[q].B.EOQF)           \
  {                                       \
    ;                                     \
  }

