openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
static void Adc_WriteEQADCRegister (Adc_EQADCRegisterType reg, Adc_EQADCRegister value)
{
  Adc_RegisterWriteType writeReg;
  uint32_t temp, oldMode;

  writeReg.R = 0;

  /* Write command. */
  writeReg.B.RW = 0;
  writeReg.B.EOQ = 1;
  writeReg.B.ADC_REG = value;
  writeReg.B.ADC_REG_ADDR = reg;

  /* Invalidate queue. */
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.CFINV = 1;


  /* Write command through FIFO. */
  EQADC.CFPR[ADC_EQADC_QUEUE_0].R = writeReg.R;

  /* Enable FIFO. */
  oldMode = EQADC.CFCR[ADC_EQADC_QUEUE_0].B.MODE;
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.MODE = ADC_CONV_MODE_ONESHOT;
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.SSE = 1;

  /* Wait for command to be executed. */
  WAIT_FOR_QUEUE_TO_FINISH(ADC_EQADC_QUEUE_0);

  /* Flush result buffer. */
  temp = EQADC.RFPR[ADC_EQADC_QUEUE_0].R;
  EQADC.FISR[ADC_EQADC_QUEUE_0].B.EOQF = 1;

  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.MODE = oldMode;

}

static Adc_EQADCRegister Adc_ReadEQADCRegister (Adc_EQADCRegisterType reg)
{
  Adc_RegisterReadType readReg;
  Adc_EQADCRegister result;
  uint32_t oldMode, dmaRequestEnable;

  readReg.R = 0;

  /* Read command. */
  readReg.B.RW = 1;
  readReg.B.EOQ = 1;
  readReg.B.ADC_REG_ADDR = reg;
  readReg.B.MESSAGE_TAG = ADC_EQADC_QUEUE_0;

  /* Make sure that DMA requests for command fill and result drain is disabled. */
  if (EQADC.IDCR[ADC_EQADC_QUEUE_0].B.RFDE || EQADC.IDCR[ADC_EQADC_QUEUE_0].B.CFFE)
  {
    EQADC.IDCR[ADC_EQADC_QUEUE_0].B.CFFE = 0;
    EQADC.IDCR[ADC_EQADC_QUEUE_0].B.RFDE = 0;

    /* Remember to enable requests again... */
    dmaRequestEnable = TRUE;
  }
  else
  {
    dmaRequestEnable = FALSE;
  }

  /* Invalidate queue. */
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.CFINV = 1;

  /* Write command through FIFO. */
  EQADC.CFPR[ADC_EQADC_QUEUE_0].R = readReg.R;

  /* Enable FIFO. */
  oldMode = EQADC.CFCR[ADC_EQADC_QUEUE_0].B.MODE;
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.MODE = ADC_CONV_MODE_ONESHOT;
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.SSE = 1;

  /* Wait for command to be executed. */
  WAIT_FOR_QUEUE_TO_FINISH(ADC_EQADC_QUEUE_0);

  /* Read result buffer. */
  result = EQADC.RFPR[ADC_EQADC_QUEUE_0].R;
  EQADC.FISR[ADC_EQADC_QUEUE_0].B.EOQF = 1;

  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.MODE = oldMode;

  if (dmaRequestEnable)
  {
    EQADC.IDCR[ADC_EQADC_QUEUE_0].B.CFFE = 1;
    EQADC.IDCR[ADC_EQADC_QUEUE_0].B.RFDE = 1;
  }
  else
  {
    /* Do nothing. */
  }
  return (result);
}
#endif 

#define SYSTEM_CLOCK_DIVIDE(f)    ((f / 2) - 1)

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
void Adc_EnableGroupNotification (Adc_GroupType group)
{
  AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable = 1;
}

void Adc_DisableGroupNotification (Adc_GroupType group)
{
  AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable = 0;
}
#endif

#if defined (CFG_MPC5606S)
static void  Adc_ConfigureADC (const Adc_ConfigType *ConfigPtr)
{
  /* Set ADC CLOCK */
  ADC_0.MCR.B.ADCLKSEL = ConfigPtr->hwConfigPtr->adcPrescale;

  ADC_0.DSDR.B.DSD = 254;

  /* Power on ADC */
  ADC_0.MCR.B.PWDN = 0;

  /* Enable DMA. */
  ADC_0.DMAE.B.DMAEN = 1;
}

void Adc_ConfigureADCInterrupts (void)
{
	ISR_INSTALL_ISR2(  "Adc_Err", Adc_ADCError, ADC_ER_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Grp", Adc_Group0ConversionComplete, ADC_EOC_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Wdg", Adc_WatchdogError, ADC_WD_INT,     2, 0 );
}

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
void Adc_StartGroupConversion (Adc_GroupType group)
{
  uint32 groupChannelIdMask = 0;
    
   /* Run development error check. */
  if (E_OK == Adc_CheckStartGroupConversion (group))
  {    	
    /* Abort conversion, for safety before resetting resultbuffer */
  	ADC_0.MCR.B.ABORTCHAIN = 1;  
  	/* Disable trigger normal conversions for ADC0 */
  	ADC_0.MCR.B.NSTART = 0;

    currGroupId = group;
    currSampleCount[group] = 0;

	  currResultBufPtr[group] = AdcConfigPtr->groupConfigPtr[group].status->resultBufferPtr; /* Set current result buffer */
#ifndef DONT_USE_DMA_IN_ADC_MPC5606S
   	  Dma_ConfigureChannel ((struct tcd_t *)(AdcConfigPtr->groupConfigPtr[group].groupDMAResults), DMA_ADC_GROUP0_RESULT_CHANNEL);
	  Dma_ConfigureDestinationAddress ((uint32_t)currResultBufPtr[group], DMA_ADC_GROUP0_RESULT_CHANNEL);
#endif
	  /* Set conversion mode. */
	  ADC_0.MCR.B.MODE = AdcConfigPtr->groupConfigPtr[group].conversionMode;

	  /* Enable Overwrite*/
	  ADC_0.MCR.B.OWREN = 1;

	  /* Set Conversion Time. */
	  ADC_0.CTR[1].B.INPLATCH = AdcConfigPtr->groupConfigPtr[group].adcChannelConvTime.INPLATCH;
	  ADC_0.CTR[1].B.INPCMP = AdcConfigPtr->groupConfigPtr[group].adcChannelConvTime.INPCMP;
	  ADC_0.CTR[1].B.INPSAMP = AdcConfigPtr->groupConfigPtr[group].adcChannelConvTime.INPSAMP;

	  /* Set group state to BUSY. */
	  AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_BUSY;

	  for(uint8 i =0; i < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; i++)
	  {
            groupChannelIdMask |= (1 << AdcConfigPtr->groupConfigPtr[group].channelList[i]);
	  }

        /* Enable Normal conversion */
        ADC_0.NCMR[1].R = groupChannelIdMask;

#ifndef DONT_USE_DMA_IN_ADC_MPC5606S
        ADC_0.DMAE.R = 0x01;

        /* Enable DMA Transfer */
        ADC_0.DMAR[1].R = groupChannelIdMask;
#endif

        /* Enable Channel Interrupt */
        ADC_0.CIMR[1].R = groupChannelIdMask;

        /* Enable ECH interrupt */
        ADC_0.IMR.B.MSKECH = 1;

#ifndef DONT_USE_DMA_IN_ADC_MPC5606S
        EDMA.SERQR.R = DMA_ADC_GROUP0_RESULT_CHANNEL;        /* Enable EDMA channel for ADC */

        EDMA.TCD[0].START  = 0;
#endif

        /* Trigger normal conversions for ADC0 */
        ADC_0.MCR.B.NSTART = 1;

        AdcConfigPtr->groupConfigPtr[group].status->isConversionStarted = TRUE;
  }
  else
  {
	/* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}

void Adc_StopGroupConversion (Adc_GroupType group)
{
  if (E_OK == Adc_CheckStopGroupConversion (group))
  {
	/* Abort conversion */
	ADC_0.MCR.B.ABORTCHAIN = 1;

	/* Disable trigger normal conversions for ADC0 */
	ADC_0.MCR.B.NSTART = 0;

	/* Set group state to IDLE. */
	AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;

	/* Disable group notification. */
	Adc_DisableGroupNotification (group);
  }
  else
  {
	/* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}
#endif  /* endof #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#else
static void  Adc_ConfigureEQADC (const Adc_ConfigType *ConfigPtr)
{
  Adc_GroupType group;

  enum
  {
    ADC_ENABLE = 0x8000,
  };
  /* Enable ADC0. */
  Adc_WriteEQADCRegister (ADC0_CR, (ADC_ENABLE | ConfigPtr->hwConfigPtr->adcPrescale));

  /* Disable time stamp timer. */
  Adc_WriteEQADCRegister (ADC0_TSCR, 0);

  for (group = ADC_GROUP0; group < ConfigPtr->nbrOfGroups; group++)
  {
    /* Enable eDMA requests for commands and results. */
    EQADC.IDCR[group].B.CFFS = 1;
    EQADC.IDCR[group].B.RFDS = 1;

